Revit 2026 API

# DirectShapeApplicationId Property

---

A text string that identifies the creating application.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string ApplicationId { get; set; }
```
```vb
Public Property ApplicationId As String
	Get
	Set
```
```cpp
public:
property String^ ApplicationId {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member ApplicationId : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The creating application may use any text string as appropriate for its purposes, or leave this property unset. One option is to use Application.ActiveAddInId for a unique application id, or concatenate it with an application name for a more informative, but still unique id.

#### Reference

DirectShape Class

Autodesk.Revit.DB Namespace